Revit 2027 API
GlobalParameter.GetFormula Method
 Returns the parameter's expression in form of a string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetFormula()
Public Function GetFormula As String
public:
String^ GetFormula()
member GetFormula : unit -> string
Return Value
String
 The string representing the expression assigned to the parameter.
Remarks
 Returns an empty string a case the parameter is not determined by a formula, or if the the expression cannot be converted to a string.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace